app/controllers/feeds_controller.rb

SELECT `feeds`.* FROM `feeds`   ORDER BY created_at DESC
---
  def new
    @feed = Feed.new
    @feeds = Feed.all.order("created_at DESC") || []

SELECT `feeds`.* FROM `feeds`   ORDER BY created_at DESC
---
  def index
    @feeds = Feed.all.order("created_at DESC")

SELECT  `feeds`.* FROM `feeds`  WHERE `feeds`.`id` = 6 LIMIT 1
---
  def show
   @feed = Feed.find(params[:id])

INSERT INTO `feeds` (`created_at`, `feed_url`, `updated_at`) VALUES ('2014-08-29 17:16:17', 'http://aaaaasssss', '2014-08-29 17:16:17')
---
  def create
    @feed = Feed.new(feed_params)
    if @feed.save

SELECT  `feeds`.* FROM `feeds`  WHERE `feeds`.`id` = 2 LIMIT 1
DELETE FROM `feeds` WHERE `feeds`.`id` = 2
---
  def destroy
      @feed = Feed.find(params[:id])
      if @feed.destroy